In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 
import numpy as np

In [16]:
df_1=pd.read_excel('employee.xlsx')
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

In [41]:
data=df_1[['BusinessTravel','EducationField','Attrition']]
df=pd.DataFrame(data)
df.head(5)

      BusinessTravel EducationField Attrition
0      Travel_Rarely  Life Sciences       Yes
1  Travel_Frequently  Life Sciences        No
2      Travel_Rarely          Other       Yes
3  Travel_Frequently  Life Sciences        No
4      Travel_Rarely        Medical        No

In [20]:
pd.get_dummies(df,columns=['BusinessTravel'],drop_first=True)

,EducationField,Attrition,BusinessTravel_Travel_Frequently,BusinessTravel_Travel_Rarely
0,Life Sciences,Yes,False,True
1,Life Sciences,No,True,False
2,Other,Yes,False,True
3,Life Sciences,No,True,False
4,Medical,No,False,True
...,...,...,...,...
1465,Medical,No,True,False
1466,Medical,No,False,True
1467,Life Sciences,No,False,True
1468,Medical,No,True,False
1469,Medical,No,False,True

In [ ]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(df.drop('Attrition',axis=1),df['Attrition'],test_size=0.3,random_state=42)

(1029, 2)

In [49]:
from sklearn.preprocessing import OneHotEncoder
ohe=OneHotEncoder(drop='first',sparse_output=True,dtype=np.int32)

X_train_trf=ohe.fit_transform(X_train[['EducationField','BusinessTravel']])

In [50]:
X_test_trf=ohe.transform(X_test[['EducationField','BusinessTravel']])

In [ ]:
X_train_trf

<Compressed Sparse Row sparse matrix of dtype 'int32'
	with 1939 stored elements and shape (1029, 7)>

In [58]:
np.hstack(X_train)

array(['BusinessTravel', 'EducationField'], dtype='<U14')